Repository: chenyynx/Agents-Anywhere
Catalog: ios/Agents Anywhere/Agents Anywhere/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ is online. Choose which agents to configure and start, or finish without adding one.
zh_hans: %@ 已上线。你可以选择要配置并启动的 Agent，也可以不添加直接完成。

source: %@ will be stopped and removed from the configured list. All associated sessions, message history, and attachments will be permanently deleted. You can configure the runtime again later; the local installation is kept.
zh_hans: %@ 会停止并从已配置列表移除，其关联的所有会话、消息记录和附件将被永久删除。之后仍可重新配置 Runtime，本机安装会保留。

source: %lld projects
zh_hans: %lld 个项目

source: %lld selected
zh_hans: 已选择 %lld 个

source: %lld sessions
zh_hans: %lld 个会话

source: %lld workspaces
zh_hans: %lld 个工作目录

# %lld 项任务进行中
source: %lld tasks in progress
zh_hans: %lld 项任务进行中

# %lld 个工具
source: %lld tools
zh_hans: %lld 个工具

# %lld 个问题
source: %lld questions
zh_hans: %lld 个问题

# %lld 次 SubAgent 调用
source: %lld subagent calls
zh_hans: %lld 次 SubAgent 调用

# %lld 次工具调用
source: %lld tool calls
zh_hans: %lld 次工具调用

# %lld 段思考
source: %lld reasoning steps
zh_hans: %lld 段思考

# 1 · 选择设备
source: 1 · Choose a device
zh_hans: 1 · 选择设备

# 2 · 选择 Agent 实例
source: 2 · Choose an Agent instance
zh_hans: 2 · 选择 Agent 实例

source: A secure sign-in request could not be created. Please try again.
zh_hans: 无法创建安全登录请求，请重试。

source: A sign-in attempt is already in progress.
zh_hans: 已有登录请求正在进行中。

source: About
zh_hans: 关于

source: Accent color
zh_hans: 强调色

source: Account
zh_hans: 账号

# Account update failed
source: Failed to update account.
zh_hans: 账号信息更新失败。

source: Active
zh_hans: 活跃

source: Active sessions in this project will be archived. You can restore them later.
zh_hans: 此项目中的活动会话将被归档，之后可以恢复。

source: Add
zh_hans: 添加

source: Add custom model
zh_hans: 添加自定义模型

source: Add effort
zh_hans: 添加强度

source: Add variable
zh_hans: 添加变量

# Administrator
source: Admin
zh_hans: 管理员

source: Agent
zh_hans: 代理

# Agent 尚未就绪
source: Agent is not ready
zh_hans: Agent 尚未就绪

# Agent 操作未完成
source: Failed to update runtime state.
zh_hans: 无法更新 Runtime 状态。

# Agent 类型
source: Runtime type
zh_hans: Runtime 类型

# Agent 调用
source: Agent call
zh_hans: Agent 调用

source: Agents Anywhere Desktop
zh_hans: Agents Anywhere 桌面应用

source: All
zh_hans: 全部

source: All projects
zh_hans: 所有项目

source: All workspaces
zh_hans: 全部工作目录

# Always use the dark appearance.
source: Dim interface
zh_hans: 暗色界面

# Always use the light appearance.
source: Bright interface
zh_hans: 明亮界面

source: Announcement
zh_hans: 公告

source: App
zh_hans: 应用

source: Appearance
zh_hans: 外观

source: Archive
zh_hans: 归档

# Archive all in scope
source: Archive all
zh_hans: 全部归档

source: Archive all sessions in %@? The project will remain available for future sessions.
zh_hans: 确定要归档“%@”下的所有会话吗？项目会保留，之后仍可继续创建会话。

# Archive project sessions
source: Archive project
zh_hans: 归档该项目

# Archive project sessions?
source: Archive project
zh_hans: 归档项目

# Archive these sessions?
source: Archive sessions?
zh_hans: 归档会话？

source: Archived
zh_hans: 已归档

source: Attach no more than %lld files.
zh_hans: 最多添加 %lld 个附件。

source: Attachment
zh_hans: 附件

source: Available
zh_hans: 可用

source: Blocked
zh_hans: 阻塞

source: Blue
zh_hans: 蓝色

source: Build
zh_hans: 构建版本

source: Camera access is required to scan the login QR code.
zh_hans: 需要摄像头权限才能扫描登录二维码。

source: Camera input is not available.
zh_hans: 摄像头输入不可用。

source: Camera is not available.
zh_hans: 摄像头不可用。

source: Cancel
zh_hans: 取消

source: Cancel Sign In
zh_hans: 取消登录

source: Choose English or Simplified Chinese in the app's iOS language settings. Without an override, the app follows your preferred system language.
zh_hans: 在 iOS 的应用语言设置中选择英语或简体中文。未单独设置时，应用会使用你偏好的系统语言。

source: Choose an avatar image before uploading.
zh_hans: 请先选择头像图片再上传。

# Choose an image smaller than 8 MB.
source: Image must be 8 MB or smaller.
zh_hans: 图片必须小于或等于 8 MB。

source: Choose an option
zh_hans: 选择一个选项

source: Choose at least one file to upload.
zh_hans: 请至少选择一个文件上传。

source: Choose how to connect %@ to your account.
zh_hans: 选择一种方式，将 %@ 连接到您的账号。

source: Choose one of the available options.
zh_hans: 请从可用选项中选择。

# Choose photo
source: Choose an image
zh_hans: 选择图片

# Claude 请求使用工具
source: Claude wants to use a tool
zh_hans: Claude 请求使用工具

source: Click confirm in the web console, then return here.
zh_hans: 在 Web 控制台确认后，返回这里。

source: Close
zh_hans: 关闭

source: Code sent. Check your inbox.
zh_hans: 验证码已发送，请查看邮箱。

# Codex 请求修改文件
source: Codex wants to edit files
zh_hans: Codex 请求修改文件

# Codex 请求执行命令
source: Codex wants to run a command
zh_hans: Codex 请求执行命令

# Codex 请求额外权限
source: Codex requests additional permissions
zh_hans: Codex 请求额外权限

source: Command
zh_hans: 命令

source: Complete all required fields in this group.
zh_hans: 请填写此组中的所有必填项。

source: Configure %@
zh_hans: 配置 %@

# Confirm Login
source: Confirm sign-in
zh_hans: 确认登录

source: Confirm on Web
zh_hans: 在 Web 中确认

source: Confirm password
zh_hans: 确认密码

source: Confirm the login on the web console and try again.
zh_hans: 请在 Web 控制台确认登录后重试。

source: Connect this device to your workspace.
zh_hans: 将此设备连接到你的工作空间。

source: Connect to Anywhere Cloud
zh_hans: 连接到 Anywhere Cloud

source: Connect to your self-hosted instance
zh_hans: 连接到自己部署的实例

source: Connected
zh_hans: 已连接

source: Connection
zh_hans: 连接

source: Connector disconnected
zh_hans: Connector 已断开

source: Connector token
zh_hans: Connector 令牌

source: Continue in Browser
zh_hans: 在浏览器中继续

source: Copied
zh_hans: 已复制

source: Copy %@
zh_hans: 复制 %@

source: Copy Device ID
zh_hans: 复制设备 ID

source: Copy Path
zh_hans: 复制路径

source: Copy server address
zh_hans: 复制服务器地址

source: Copy Session ID
zh_hans: 复制会话 ID

source: Could not access sign-in credentials in the Keychain (error %@).
zh_hans: 无法访问钥匙串中的登录凭据（错误 %@）。

source: Could not access sign-in credentials in the Keychain (error %@): %@
zh_hans: 无法访问钥匙串中的登录凭据（错误 %@）：%@

source: Could not check the login status.
zh_hans: 无法检查登录状态。

source: Could not sign out
zh_hans: 无法退出登录

source: Could not update session
zh_hans: 无法更新会话

source: Could not use photo
zh_hans: 无法使用照片

source: Create
zh_hans: 创建

source: Create project
zh_hans: 创建项目

source: Created %@
zh_hans: 已创建 %@

source: Current language
zh_hans: 当前语言

source: Current login status: %@
zh_hans: 当前登录状态：%@

# Custom model
source: Model
zh_hans: 模型

source: Cyan
zh_hans: 青色

# DSH 现可实时同步（Beta）Agents Anywhere。启用接管即可发送消息。
source: DSH now syncs in real time (Beta) with Agents Anywhere. Turn on takeover to send messages.
zh_hans: DSH 现可实时同步（Beta）Agents Anywhere。启用接管即可发送消息。

source: Dark
zh_hans: 深色

source: Default
zh_hans: 默认

source: Delete
zh_hans: 删除

source: Delete device
zh_hans: 删除设备

source: Delete project
zh_hans: 删除项目

source: Delete project?
zh_hans: 删除项目？

# Delete this device?
source: Delete device?
zh_hans: 删除设备？

source: Details
zh_hans: 详情

source: Device actions
zh_hans: 设备操作

source: Device disconnected. Your changes are kept until it reconnects.
zh_hans: 设备已断开连接。重新连接前，你的修改会保留。

source: Device name
zh_hans: 设备名

source: Device offline
zh_hans: 设备离线

source: Device settings
zh_hans: 设备设置

source: Devices
zh_hans: 设备

source: Discard changes
zh_hans: 放弃修改

source: Discard unsaved changes?
zh_hans: 放弃未保存的修改？

source: Disconnected
zh_hans: 已断开

source: Discovering…
zh_hans: 正在发现…

source: Display name
zh_hans: 展示名称

source: Do you want to sign in as %@?
zh_hans: 以 %@ 的身份登录？

source: Done
zh_hans: 完成

source: Effort ID
zh_hans: 强度 ID

source: Email
zh_hans: 邮箱

source: Email status
zh_hans: 邮箱状态

source: Email verification code
zh_hans: 邮箱验证码

# Empty Folder
source: This folder is empty
zh_hans: 文件夹为空

source: Enter Server
zh_hans: 输入服务器

source: Enter a device name before continuing.
zh_hans: 请先输入设备名称再继续。

source: Enter a message before sending.
zh_hans: 请先输入消息再发送。

source: Enter a session title.
zh_hans: 请输入会话标题。

source: Enter a valid number.
zh_hans: 请输入有效的数字。

source: Enter a valid server URL.
zh_hans: 请输入有效的服务器地址。

source: Enter a valid value for %@.
zh_hans: 请为 %@ 输入有效值。

source: Enter a value in the required format.
zh_hans: 请按要求的格式填写。

source: Enter the 6-digit pairing code shown on the device.
zh_hans: 请输入设备上显示的六位配对码。

source: Enter valid JSON.
zh_hans: 请输入有效的 JSON。

source: Enter your server address, then sign in with the server's web login.
zh_hans: 输入服务器地址，再通过服务器的网页登录。

source: Error
zh_hans: 错误

source: Files
zh_hans: 文件

source: Gateway URL
zh_hans: Gateway 地址

source: Go to Dashboard
zh_hans: 进入工作空间

source: Got it
zh_hans: 我知道了

source: Green
zh_hans: 绿色

source: Hide secret
zh_hans: 隐藏密钥

# Home 目录
source: Home directory
zh_hans: Home 目录

source: Idle
zh_hans: 空闲

source: Input
zh_hans: 输入

source: Instance name
zh_hans: 实例名称

source: Keep editing
zh_hans: 继续编辑

source: Language
zh_hans: 语言

source: Light
zh_hans: 浅色

source: Lime
zh_hans: 青柠绿

source: List items must be unique.
zh_hans: 列表项不能重复。

source: Loading devices...
zh_hans: 加载设备中...

# Loading email settings…
source: Loading...
zh_hans: 加载中...

# Loading files...
source: Loading...
zh_hans: 加载中...

source: Loading sessions...
zh_hans: 加载会话中...

source: Local Network Access
zh_hans: 局域网访问

source: Local Network access is disabled. Enable it for Agents Anywhere in Settings, then try again.
zh_hans: 局域网访问权限已关闭。请在系统设置中为 Agents Anywhere 开启权限后重试。

# Log In
source: Sign in
zh_hans: 登录

source: Login Request Failed
zh_hans: 登录请求失败

source: Login Status
zh_hans: 登录状态

source: Login Success
zh_hans: 登录成功

source: Magenta
zh_hans: 洋红色

source: Manual Login
zh_hans: 手动登录

# Match the device appearance.
source: Follow system
zh_hans: 跟随系统

source: Member
zh_hans: 成员

source: Missing '%@' in %@.
zh_hans: 在 %2$@ 中缺少“%1$@”。

source: Model ID
zh_hans: 模型 ID

source: Model IDs must be unique.
zh_hans: 模型 ID 不能重复。

source: Modified %@
zh_hans: 已修改 %@

source: Name
zh_hans: 名称

source: New credential
zh_hans: 新凭据

source: New device
zh_hans: 新设备

source: New password
zh_hans: 新密码

source: New session
zh_hans: 新会话

source: Nickname
zh_hans: 昵称

source: No custom models.
zh_hans: 还没有自定义模型。

source: No devices.
zh_hans: 无设备。

source: No environment overrides.
zh_hans: 没有环境变量覆盖。

source: No pinned sessions
zh_hans: 没有置顶会话

source: No projects yet.
zh_hans: 暂无项目。

# No sessions here
source: No sessions.
zh_hans: 没有会话。

source: No sessions yet
zh_hans: 还没有会话

source: No workspaces yet.
zh_hans: 还没有工作目录。

# Not verified
source: Unverified
zh_hans: 未验证

source: OK
zh_hans: 好的

source: offline
zh_hans: 离线

source: online
zh_hans: 在线

source: Only empty projects can be deleted. Files on the device are kept.
zh_hans: 只能删除没有会话的项目，设备上的文件会保留。

source: Open
zh_hans: 打开

source: Open Settings
zh_hans: 打开设置

source: Open iOS Settings
zh_hans: 打开 iOS 设置

# Open sidebar
source: Expand sidebar
zh_hans: 展开侧栏

source: Open-source notices
zh_hans: 开源许可

source: Orange
zh_hans: 橙色

source: Output
zh_hans: 输出

source: Pair device
zh_hans: 配对设备

source: Password
zh_hans: 密码

source: Password must be at least 8 characters.
zh_hans: 密码至少需要 8 个字符。

source: Passwords do not match.
zh_hans: 两次输入的密码不一致。

source: Pending
zh_hans: 等待中

source: Pin
zh_hans: 置顶

source: Pink
zh_hans: 粉色

source: Pinned
zh_hans: 已置顶

source: Point the camera at the web QR code
zh_hans: 将摄像头对准 Web 上的二维码

# Profile photo
source: Change avatar
zh_hans: 更换头像

source: Project
zh_hans: 项目

# Project actions
source: Project options
zh_hans: 项目操作

source: Project mode
zh_hans: 项目模式

source: Projects
zh_hans: 项目

source: Published %@
zh_hans: 发布于 %@

# QR Code Login
source: Scan to sign in
zh_hans: 扫码登录

source: QR scanner output is not available.
zh_hans: 二维码扫描输出不可用。

source: Reasoning effort IDs must be unique within a model.
zh_hans: 同一模型内的推理强度 ID 不能重复。

# Reasoning efforts
source: Efforts
zh_hans: 推理强度

# Recent
source: Recents
zh_hans: 最近

source: Remove effort
zh_hans: 删除推理强度

source: Remove inherited variable
zh_hans: 移除继承的变量

# Remove model
source: Remove custom model
zh_hans: 删除自定义模型

# Remove profile photo
source: Remove
zh_hans: 移除

# Remove variable
source: Remove environment variable
zh_hans: 删除环境变量

source: Rename
zh_hans: 重命名

source: Rename device
zh_hans: 重命名设备

source: Rename project
zh_hans: 重命名项目

source: Rename session
zh_hans: 重命名会话

source: Request failed
zh_hans: 请求失败

source: Resend in %llds
zh_hans: %lld 秒后重发

source: Reset all defaults
zh_hans: 全部恢复默认值

# Restore
source: Unarchive
zh_hans: 取消归档

# Restore all in scope
source: Unarchive all
zh_hans: 全部取消归档

# Restore these sessions?
source: Unarchive sessions?
zh_hans: 取消归档会话？

source: Retry
zh_hans: 重试

source: Retry loading email settings
zh_hans: 重新加载邮箱设置

source: Return to the app and try signing in again.
zh_hans: 请返回应用后重新登录。

source: Review the highlighted configuration fields.
zh_hans: 请检查标出的配置项。

source: Rotate connector credential?
zh_hans: 更换 Connector 凭据？

source: Rotate credential
zh_hans: 更换凭据

source: Run this command in the terminal on %@ to connect it to your account automatically.
zh_hans: 在 %@ 的终端中运行下方命令，设备会自动连接到您的账号。

source: Running
zh_hans: 运行中

source: Save
zh_hans: 保存

source: Scan Agents Anywhere QR
zh_hans: 扫描 Agents Anywhere 二维码

source: Scan the login QR code from the web console.
zh_hans: 扫描 Web 控制台上的登录二维码。

source: Select at least one session.
zh_hans: 请至少选择一个会话。

source: Select no more than 200 sessions at once.
zh_hans: 一次最多选择 200 个会话。

# Select sessions
source: Select
zh_hans: 选择

source: Select up to 200 sessions
zh_hans: 最多选择 200 个会话

# Send verification code
source: Send code
zh_hans: 发送验证码

source: Server
zh_hans: 服务器

# Server URL
source: Server address
zh_hans: 服务器地址

source: Server Unavailable
zh_hans: 服务器不可用

source: Session ID
zh_hans: 会话 ID

source: Session filter
zh_hans: 会话筛选

source: Session title
zh_hans: 会话标题

source: Sessions
zh_hans: 会话

source: Settings
zh_hans: 设置

source: Show all %lld more
zh_hans: 显示全部，另有 %lld 个

source: Show less
zh_hans: 收起

source: Show project sessions
zh_hans: 查看项目会话

source: Show secret
zh_hans: 显示密钥

source: Showing cached content
zh_hans: 正在显示缓存内容

source: Sign In Failed
zh_hans: 登录失败

source: Sign in was cancelled. You can try again.
zh_hans: 登录已取消，可以重试。

source: Sign in was not completed: %@
zh_hans: 登录未完成：%@

source: Sign out
zh_hans: 退出登录

source: Some files are not shown.
zh_hans: 部分文件未显示。

source: Starting…
zh_hans: 正在启动…

source: Status
zh_hans: 状态

source: Stopped
zh_hans: 已停止

source: Stopping…
zh_hans: 正在停止…

# SubAgent 进展 · %lld 项
source: SubAgent progress · %lld items
zh_hans: SubAgent 进展 · %lld 项

# System
source: Follow system
zh_hans: 跟随系统

source: The app's signing configuration does not allow access to sign-in credentials in the Keychain (error %@).
zh_hans: 应用签名缺少钥匙串访问权限，无法访问登录凭据（错误 %@）。

source: The attachment '%@' exceeds the 25 MiB file limit.
zh_hans: 附件“%@”超过了 25 MiB 的大小限制。

source: The attachment '%@' is empty.
zh_hans: 附件“%@”为空。

source: The attachment content is not valid Base64 data.
zh_hans: 附件内容不是有效的 Base64 数据。

source: The avatar image could not be prepared.
zh_hans: 无法处理头像图片。

source: The current desktop Connector will disconnect. Replace its saved token with the new credential before reconnecting.
zh_hans: 当前桌面 Connector 将断开连接。重新连接前，请将其保存的令牌替换为新凭据。

source: The device and its server-owned metadata will be removed. This action cannot be undone.
zh_hans: 设备及其在服务器上的元数据将被移除，此操作无法撤销。

source: The downloaded image could not be read.
zh_hans: 下载的图片无法读取。

source: The downloaded image failed its integrity check.
zh_hans: 下载的图片未通过完整性校验。

source: The file preview URL is invalid.
zh_hans: 文件预览地址无效。

source: The image could not be stored on this device.
zh_hans: 图片无法存储到此设备。

source: The list has an invalid number of items.
zh_hans: 列表项数量不符合要求。

source: The live update buffer is full. Reconnect and recover session events.
zh_hans: 实时更新缓冲区已满，请重新连接并恢复会话记录。

source: The login could not be completed.
zh_hans: 无法完成登录。

source: The login request could not be started.
zh_hans: 无法发起登录请求。

source: The number is outside the allowed range.
zh_hans: 数字超出了允许范围。

source: The previous credential no longer works. Update the desktop Connector with these values before reconnecting it.
zh_hans: 原凭据已失效。重新连接前，请使用以下信息更新桌面 Connector。

source: The request URL is invalid: %@
zh_hans: 请求地址无效：%@

source: The requested page size is outside the supported range.
zh_hans: 请求的分页大小超出了支持范围。

source: The runtime configuration schema is unavailable or invalid.
zh_hans: 运行时配置结构不可用或格式无效。

source: The runtime did not accept this operation.
zh_hans: Agent 未接受此操作。

source: The runtime did not accept this selection.
zh_hans: Agent 未接受此选项。

source: The runtime reported an error.
zh_hans: 运行时返回了一个错误。

source: The secure sign-in browser could not open. Please try again.
zh_hans: 无法打开安全登录浏览器，请重试。

source: The selected file is not a supported image.
zh_hans: 所选文件不是受支持的图片格式。

source: The server could not be reached.
zh_hans: 无法连接到服务器。

source: The server did not accept this pairing request.
zh_hans: 服务器未接受此配对请求。

source: The server did not return a valid sign-in token. Please try again.
zh_hans: 服务器未返回有效的登录令牌，请重试。

source: The server login opens in a secure web session. You can use password login or any OAuth provider configured on that server.
zh_hans: 将在安全的网页会话中登录服务器。可以使用密码或服务器已配置的 OAuth 登录方式。

source: The server response could not be decoded at '%@'.
zh_hans: 无法解析服务器响应中的“%@”。

source: The server response could not be decoded.
zh_hans: 无法解析服务器响应。

source: The server response has an invalid type at '%@' for %@.
zh_hans: 服务器响应中“%@”的类型不符合 %@ 的要求。

source: The server response is missing '%@'.
zh_hans: 服务器响应缺少“%@”。

source: The server response is missing a value at '%@' for %@.
zh_hans: 服务器响应中“%@”缺少 %@ 类型的值。

source: The server returned an invalid response.
zh_hans: 服务器返回了无效响应。

source: The session connection closed.
zh_hans: 会话连接已关闭。

source: The session request no longer belongs to the active cache.
zh_hans: 此会话请求已不属于当前缓存。

source: The sign-in URL is invalid. Check the server address.
zh_hans: 登录地址无效，请检查服务器地址。

source: The sign-in callback is missing, expired or does not match this attempt. Please sign in again.
zh_hans: 登录回调缺失、过期或与本次请求不匹配，请重新登录。

source: The signed-in server is unavailable.
zh_hans: 当前登录的服务器不可用。

source: The value has an unsupported type or format.
zh_hans: 值的类型或格式不受支持。

source: The value is too long.
zh_hans: 内容过长。

source: The workspace directory is unavailable.
zh_hans: 工作目录不可用。

source: The workspace “%1$@” already belongs to “%2$@”. Continuing will rename that project to “%3$@” instead of creating a duplicate. Its sessions and settings will be preserved.
zh_hans: 工作目录“%1$@”已属于项目“%2$@”。继续后不会创建新项目，而会把现有项目重命名为“%3$@”；项目内的会话和设置都会保留。

source: This QR code is not a valid Agents Anywhere login code.
zh_hans: 这不是有效的 Agents Anywhere 登录二维码。

source: This applies to all sessions in the selected scope, including those not loaded yet.
zh_hans: 此操作适用于所选范围内的全部会话，包括尚未加载的会话。

source: This configuration contains an unsupported field.
zh_hans: 配置包含不受支持的字段。

source: This field is required.
zh_hans: 此项为必填项。

source: This image has no download URL.
zh_hans: 这张图片没有可用的下载地址。

source: This is not an Agents Anywhere mobile login QR code.
zh_hans: 这不是 Agents Anywhere 移动端登录二维码。

source: This login request expired. Scan a new QR code.
zh_hans: 此登录请求已过期，请扫描新的二维码。

source: This login request has already been used.
zh_hans: 此登录请求已被使用。

source: This login request was rejected.
zh_hans: 此登录请求已被拒绝。

# This model has no custom reasoning efforts.
source: No efforts configured.
zh_hans: 未设置推理强度。

source: This selection is currently unavailable.
zh_hans: 此选项当前不可用。

# This service accepts email without a verification code.
source: Email codes are disabled by the administrator. Saving marks the address as verified.
zh_hans: 管理员未开启邮箱验证码，保存后邮箱直接标记为已验证。

source: This token is shown only now. Store it in the Connector configuration and do not share it.
zh_hans: 此令牌仅展示一次。请将其保存到 Connector 配置中，不要分享给他人。

source: This will permanently remove %@ and all its associated data. This action cannot be undone.
zh_hans: 这会永久移除 %@ 以及所有关联数据。此操作不可撤销。

source: This workspace item cannot be previewed.
zh_hans: 此文件无法预览。

# Unable to Load Files
source: Failed to load directory.
zh_hans: 无法加载目录。

source: Unavailable
zh_hans: 暂无

source: Unknown
zh_hans: 未知

source: Unpin
zh_hans: 取消置顶

source: Untitled session
zh_hans: 未命名会话

# Use at least 8 characters. Changing the password does not sign out this device.
source: Use at least 8 characters.
zh_hans: 至少使用 8 个字符。

source: User
zh_hans: 用户

source: Validating…
zh_hans: 正在验证…

source: Value
zh_hans: 值

source: Variable actions
zh_hans: 变量操作

source: Variable name
zh_hans: 变量名

source: Variable names must be unique.
zh_hans: 环境变量名称不能重复。

source: Verified
zh_hans: 已验证

source: Version
zh_hans: 版本

source: Wait for the session to reconnect before sending.
zh_hans: 请等待会话重新连接后再发送。

source: Waiting
zh_hans: 等待中

# Waiting for approval
source: Waiting approval
zh_hans: 等待批准

source: Waiting for confirmation
zh_hans: 等待确认

source: Workspace
zh_hans: 工作区

source: Yellow
zh_hans: 黄色

source: You are not signed in.
zh_hans: 你尚未登录。

source: You are offline. Cached content is still available.
zh_hans: 网络已断开，仍可查看缓存内容。

source: Your iPhone is signed in. Go to your dashboard to continue.
zh_hans: 此设备已登录，进入工作空间即可继续。

source: You will need to sign in again to access this instance.
zh_hans: 你需要重新登录才能访问此实例。

source: Zoom
zh_hans: 缩放

# dashboard.device.agentRuntimes
source: Agent runtimes
zh_hans: Agent Runtime

# dashboard.device.archiveSelected
source: Archive selected
zh_hans: 归档已选择

# dashboard.device.availableRuntimeTypes
source: Available to add
zh_hans: 可添加

# dashboard.device.configure
source: Configure
zh_hans: 配置

# dashboard.device.customEffortDisplayName
source: Effort name
zh_hans: 强度名称

# dashboard.device.hideModelGatewayApiKey
source: Hide gateway API key
zh_hans: 隐藏 Gateway API Key

# dashboard.device.runtimeConfigComponents.customModels.description
source: Add models to show in the model picker, plus the reasoning efforts available for each model.
zh_hans: 手动添加要显示在模型选择器里的模型，以及每个模型可用的推理强度。

# dashboard.device.runtimeConfigComponents.customModels.label
source: Custom models (optional)
zh_hans: 自定义模型（可选）

# dashboard.device.runtimeConfigComponents.keyValue.description
source: Environment variables added or overridden when this runtime starts.
zh_hans: 启动这个 Runtime 时追加或覆盖的环境变量。

# dashboard.device.runtimeConfigComponents.keyValue.label
source: Environment variables (optional)
zh_hans: 环境变量（可选）

# dashboard.device.runtimeConfigComponents.modelGateway.description
source: Route this runtime's model requests through a compatible custom gateway. Leave both fields empty to use the runtime's default endpoint and authentication.
zh_hans: 让这个 Runtime 通过兼容的自定义 Gateway 发送模型请求。两个字段都留空时，继续使用 Runtime 默认的模型地址和认证。

# dashboard.device.runtimeConfigComponents.modelGateway.label
source: Model gateway (optional)
zh_hans: 模型 Gateway（可选）

# dashboard.device.runtimeConfigComponents.modelGateway.requiredDescription
source: A new Codex instance must use a model gateway. Enter its URL and API key.
zh_hans: 新 Codex 实例必须使用模型 Gateway，请填写 Gateway 地址和 API Key。

# dashboard.device.runtimeConfigComponents.modelGateway.requiredLabel
source: Model gateway
zh_hans: 模型 Gateway

# dashboard.device.runtimeConfigFields.claudeExecutablePath.description
source: Optional. Fill this only when Claude Code is not available on the default PATH.
zh_hans: 可选。只有 Claude Code 不在默认 PATH 时才需要填写。

# dashboard.device.runtimeConfigFields.claudeExecutablePath.label
source: Claude executable path (optional)
zh_hans: Claude 可执行文件路径（可选）

# dashboard.device.runtimeConfigFields.codexExecutablePath.description
source: Optional. When set, this executable is always used and Use System Codex is ignored. Leave it empty to use automatic binary selection.
zh_hans: 可选。填写后将始终使用该程序，并忽略“使用系统 Codex”设置。留空则使用自动选择策略。

# dashboard.device.runtimeConfigFields.codexExecutablePath.label
source: Codex executable path (optional)
zh_hans: Codex 可执行文件路径（可选）
